import React from "react";
import { ComponentStory, ComponentMeta } from "@storybook/react";

import Table from "./Table";

export default {
	title: "Table",
	component: Table,
} as ComponentMeta<typeof Table>;

const Story: ComponentStory<typeof Table> = args => {
	return <Table {...args} />;
};

export const Default = Story.bind({});

Default.args = {
	columns: [
		{
			label: "شماره پرونده",
			showSortIcon: true,
			key: "docNumber",
		},
		{
			label: "نام و نام خانوادگی",
			key: "familyName",
			showSortIcon: true,
		},
		{
			label: "شماره موبایل",
			key: "number",
		},
		{
			label: "نوبت بعدی",
			showSortIcon: true,
			key: "nextApp",
		},
		{
			label: "نوبت قبلی",
			showSortIcon: true,
			key: "prevApp",
		},
		{
			label: "بیمه",
			showSortIcon: true,
			key: "insurance",
		},
		{
			label: "تاریخ ثبت پرونده",
			showSortIcon: true,
			key: "docCreateTime",
		},
	],
	onSortBaseChange(sortList) {},
	onSelection(selectedRecordRows) {},
	selectionEnable: true,
	// headerSticky: true,
	data: [
		[24849, "مریم شفیعی زمانی", "۰۹۱۵۳۵۶۴۲۲۵", "۱۲ آبان ۱۴۰۱ - ۷:۰۰ صبح", "۱۲ آبان ۱۴۰۱", "کارآفرین ایران", "۵ آبان ۱۴۰۱"],
		[24849, "مریم شفیعی زمانی", "۰۹۱۵۳۵۶۴۲۲۵", "۱۲ آبان ۱۴۰۱ - ۷:۰۰ صبح", "۱۲ آبان ۱۴۰۱", "کارآفرین ایران", "۵ آبان ۱۴۰۱"],
		[24849, "مریم شفیعی زمانی", "۰۹۱۵۳۵۶۴۲۲۵", "۱۲ آبان ۱۴۰۱ - ۷:۰۰ صبح", "۱۲ آبان ۱۴۰۱", "کارآفرین ایران", "۵ آبان ۱۴۰۱"],
		[24849, "مریم شفیعی زمانی", "۰۹۱۵۳۵۶۴۲۲۵", "۱۲ آبان ۱۴۰۱ - ۷:۰۰ صبح", "۱۲ آبان ۱۴۰۱", "کارآفرین ایران", "۵ آبان ۱۴۰۱"],
		[24849, "مریم شفیعی زمانی", "۰۹۱۵۳۵۶۴۲۲۵", "۱۲ آبان ۱۴۰۱ - ۷:۰۰ صبح", "۱۲ آبان ۱۴۰۱", "کارآفرین ایران", "۵ آبان ۱۴۰۱"],
		[24849, "مریم شفیعی زمانی", "۰۹۱۵۳۵۶۴۲۲۵", "۱۲ آبان ۱۴۰۱ - ۷:۰۰ صبح", "۱۲ آبان ۱۴۰۱", "کارآفرین ایران", "۵ آبان ۱۴۰۱"],
		[24849, "مریم شفیعی زمانی", "۰۹۱۵۳۵۶۴۲۲۵", "۱۲ آبان ۱۴۰۱ - ۷:۰۰ صبح", "۱۲ آبان ۱۴۰۱", "کارآفرین ایران", "۵ آبان ۱۴۰۱"],
		[24849, "مریم شفیعی زمانی", "۰۹۱۵۳۵۶۴۲۲۵", "۱۲ آبان ۱۴۰۱ - ۷:۰۰ صبح", "۱۲ آبان ۱۴۰۱", "کارآفرین ایران", "۵ آبان ۱۴۰۱"],
		[24849, "مریم شفیعی زمانی", "۰۹۱۵۳۵۶۴۲۲۵", "۱۲ آبان ۱۴۰۱ - ۷:۰۰ صبح", "۱۲ آبان ۱۴۰۱", "کارآفرین ایران", "۵ آبان ۱۴۰۱"],
		[24849, "مریم شفیعی زمانی", "۰۹۱۵۳۵۶۴۲۲۵", "۱۲ آبان ۱۴۰۱ - ۷:۰۰ صبح", "۱۲ آبان ۱۴۰۱", "کارآفرین ایران", "۵ آبان ۱۴۰۱"],
		[24849, "مریم شفیعی زمانی", "۰۹۱۵۳۵۶۴۲۲۵", "۱۲ آبان ۱۴۰۱ - ۷:۰۰ صبح", "۱۲ آبان ۱۴۰۱", "کارآفرین ایران", "۵ آبان ۱۴۰۱"],
		[24849, "مریم شفیعی زمانی", "۰۹۱۵۳۵۶۴۲۲۵", "۱۲ آبان ۱۴۰۱ - ۷:۰۰ صبح", "۱۲ آبان ۱۴۰۱", "کارآفرین ایران", "۵ آبان ۱۴۰۱"],
		[24849, "مریم شفیعی زمانی", "۰۹۱۵۳۵۶۴۲۲۵", "۱۲ آبان ۱۴۰۱ - ۷:۰۰ صبح", "۱۲ آبان ۱۴۰۱", "کارآفرین ایران", "۵ آبان ۱۴۰۱"],
		[24849, "مریم شفیعی زمانی", "۰۹۱۵۳۵۶۴۲۲۵", "۱۲ آبان ۱۴۰۱ - ۷:۰۰ صبح", "۱۲ آبان ۱۴۰۱", "کارآفرین ایران", "۵ آبان ۱۴۰۱"],
		[24849, "مریم شفیعی زمانی", "۰۹۱۵۳۵۶۴۲۲۵", "۱۲ آبان ۱۴۰۱ - ۷:۰۰ صبح", "۱۲ آبان ۱۴۰۱", "کارآفرین ایران", "۵ آبان ۱۴۰۱"],
		[24849, "مریم شفیعی زمانی", "۰۹۱۵۳۵۶۴۲۲۵", "۱۲ آبان ۱۴۰۱ - ۷:۰۰ صبح", "۱۲ آبان ۱۴۰۱", "کارآفرین ایران", "۵ آبان ۱۴۰۱"],
		[24849, "مریم شفیعی زمانی", "۰۹۱۵۳۵۶۴۲۲۵", "۱۲ آبان ۱۴۰۱ - ۷:۰۰ صبح", "۱۲ آبان ۱۴۰۱", "کارآفرین ایران", "۵ آبان ۱۴۰۱"],
		[24849, "مریم شفیعی زمانی", "۰۹۱۵۳۵۶۴۲۲۵", "۱۲ آبان ۱۴۰۱ - ۷:۰۰ صبح", "۱۲ آبان ۱۴۰۱", "کارآفرین ایران", "۵ آبان ۱۴۰۱"],
		[24849, "مریم شفیعی زمانی", "۰۹۱۵۳۵۶۴۲۲۵", "۱۲ آبان ۱۴۰۱ - ۷:۰۰ صبح", "۱۲ آبان ۱۴۰۱", "کارآفرین ایران", "۵ آبان ۱۴۰۱"],
		[24849, "مریم شفیعی زمانی", "۰۹۱۵۳۵۶۴۲۲۵", "۱۲ آبان ۱۴۰۱ - ۷:۰۰ صبح", "۱۲ آبان ۱۴۰۱", "کارآفرین ایران", "۵ آبان ۱۴۰۱"],
		[24849, "مریم شفیعی زمانی", "۰۹۱۵۳۵۶۴۲۲۵", "۱۲ آبان ۱۴۰۱ - ۷:۰۰ صبح", "۱۲ آبان ۱۴۰۱", "کارآفرین ایران", "۵ آبان ۱۴۰۱"],
	],
};
